In [2]:
! pip install pandas

Access is denied.

In [3]:
import pandas as pd

In [4]:
# Creating an empty series
x = pd.Series()
print("empty series example:",x)

empty series example: Series([], dtype: object)

In [5]:
# series example
Series1 = pd.Series([10,20,30,50])
print(Series1)

0    10
1    20
2    30
3    50
dtype: int64

In [6]:
# re-indexing the defultt index column
Series2 = pd.Series([10,20,30,50], index=['a','b','c','d'])
print(Series2)

a    10
b    20
c    30
d    50
dtype: int64

In [7]:
# accessing a series element
Series2['b']

np.int64(20)

In [8]:
# data manipulation with series
print("adding 5 to a Series:",Series2 + 5)

adding 5 to a Series: a    15
b    25
c    35
d    55
dtype: int64

In [9]:
print("filtering series with greater than 30:",Series2[Series2>30])

filtering series with greater than 30: d    50
dtype: int64

In [10]:
import numpy as np

In [11]:
print("square root of Series elements:",np.sqrt(Series2))

square root of Series elements: a    3.162278
b    4.472136
c    5.477226
d    7.071068
dtype: float64

In [12]:
# a sample dictionary
data = {'abc': 1,'def': 2,'ghi': 3}
print("dictionary example:",data)
# converting dictionary to series
pd.Series(data)

dictionary example: {'abc': 1, 'def': 2, 'ghi': 3}

abc    1
def    2
ghi    3
dtype: int64

In [13]:
# creating an empty dataframe
df = pd.DataFrame()
print("dataframe example:",df)

dataframe example: Empty DataFrame
Columns: []
Index: []

In [14]:
# a sample list containing name and age
data = [['Tom',10],['Harry',12],['Jim',13]]
# creating a dataframe from given list with column names
df = pd.DataFrame(data,columns=['Name','Age'])
df

    Name  Age
0    Tom   10
1  Harry   12
2    Jim   13

In [15]:
# accessing a dataframe column- first way
df['Name']

0      Tom
1    Harry
2      Jim
Name: Name, dtype: object

In [16]:
#accessing a dataframe column-second way
df.Name

0      Tom
1    Harry
2      Jim
Name: Name, dtype: object

In [17]:
# adding a column in existing dataframe
df['Year'] = 2008


df

    Name  Age  Year
0    Tom   10  2008
1  Harry   12  2008
2    Jim   13  2008

In [18]:
df['marks'] = 80
df

    Name  Age  Year  marks
0    Tom   10  2008     80
1  Harry   12  2008     80
2    Jim   13  2008     80

In [19]:
print("original dataframe:",df)

original dataframe:     Name  Age  Year  marks
0    Tom   10  2008     80
1  Harry   12  2008     80
2    Jim   13  2008     80

In [20]:
del df['Year']
print("dataframe after del:",df)

dataframe after del:     Name  Age  marks
0    Tom   10     80
1  Harry   12     80
2    Jim   13     80

In [21]:
df.pop('Age')
print("dataframe after pop:",df)

dataframe after pop:     Name  marks
0    Tom     80
1  Harry     80
2    Jim     80

# .loc and .iloc

In [23]:
# a sample dataframe containing company stock data
data = pd.DataFrame({'price':[95,25,85,41],'ticker':['AXP','CSCO','DIS','MSFT'],'Company':['American Express','Cisco','Walt Disney','Microsoft']})
data

   price ticker           Company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT         Microsoft

In [24]:
# access the value that is at index 0,in column 'Company' using loc
print(data.loc[0]['Company'])

American Express

In [25]:
# access the value that is at index 0, in column "company" using iloc 
print(data.loc[0][0])

95

C:\Users\AUSU\AppData\Local\Temp\ipykernel_9484\3404237754.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(data.loc[0][0])

# Dataframe functions

In [41]:
# inspecting top 5 rows of a dataframe
print("top five data:",data.head())

top five data:    price ticker           Company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT         Microsoft

In [28]:
# inspecting below 5 rows of a dataframe
print("below 5 data:",data.tail())

below 5 data:    price ticker           Company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT         Microsoft

In [29]:
# check data type of columns
data.dtypes

price       int64
ticker     object
Company    object
dtype: object

In [30]:
# descriptive statistics of the data
data.describe()

           price
count   4.000000
mean   61.500000
std    33.798422
min    25.000000
25%    37.000000
50%    63.000000
75%    87.500000
max    95.000000

In [31]:
# information of dataframe
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   price    4 non-null      int64
 1   ticker   4 non-null      object
 2   Company  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [32]:
import numpy as np

In [33]:
# Handling missing values in dataframe

In [54]:
# a sample dataframe
df = pd.DataFrame(np.random.randn(5,3),index=['a','c','e','f','h'],columns=['one','two','three'])
# creating a data with missing values by reindexing
df2 = df.reindex(['a','b','c','d','e','f','g','h'])
df2

        one       two     three
a  0.593409  1.329270  0.008051
b       NaN       NaN       NaN
c  0.242751 -1.058028  0.787415
d       NaN       NaN       NaN
e  0.425333 -0.317723 -1.846370
f -0.657084 -0.176961 -1.285213
g       NaN       NaN       NaN
h -0.186097  0.804256  0.449399

In [55]:
# checking missing values using isnull()
print(df2.isnull())
missing_values_count = df2.isnull().sum()
print("count of missing values:",missing_values_count)

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False
count of missing values: one      3
two      3
three    3
dtype: int64

In [56]:
# remove all the rows that contain a missing value
df2 = df2.dropna()
print(df2)

        one       two     three
a  0.593409  1.329270  0.008051
c  0.242751 -1.058028  0.787415
e  0.425333 -0.317723 -1.846370
f -0.657084 -0.176961 -1.285213
h -0.186097  0.804256  0.449399

In [57]:
# remove all columns with at least one missing value
columns_with_na_dropped = df2.dropna(axis=1)
columns_with_na_dropped.head()

        one       two     three
a  0.593409  1.329270  0.008051
c  0.242751 -1.058028  0.787415
e  0.425333 -0.317723 -1.846370
f -0.657084 -0.176961 -1.285213
h -0.186097  0.804256  0.449399

In [58]:
# filling NAN with zeros
df3 = df2.fillna(0)
df3

        one       two     three
a  0.593409  1.329270  0.008051
c  0.242751 -1.058028  0.787415
e  0.425333 -0.317723 -1.846370
f -0.657084 -0.176961 -1.285213
h -0.186097  0.804256  0.449399

In [59]:
# replace all NA's the value that comes directly after it in the same column
# then replace all the reamining na's with 0
df4 = df2.fillna(method = 'bfill',axis=0).fillna(0)
df4

C:\Users\AUSU\AppData\Local\Temp\ipykernel_9484\1265575388.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df4 = df2.fillna(method = 'bfill',axis=0).fillna(0)

        one       two     three
a  0.593409  1.329270  0.008051
c  0.242751 -1.058028  0.787415
e  0.425333 -0.317723 -1.846370
f -0.657084 -0.176961 -1.285213
h -0.186097  0.804256  0.449399